# 1. pandas
## pandas의 특징
### pandas의 특징
* Numpy를 내부적으로 활용함(numpy의 특징을 그대로 가짐)
* 데이터 분석에 특화된 데이터 구조 제공
* 다양한 데이터 분석 함수 제공
* 데이터베이스에 쉽게 연결 가능
* json데이터나 table요소를 데이터프레임으로 손쉽게 변형 가능

In [1]:
# 설치
# !pip install pandas
# !conda install pandas

# 2. Pandas에서 다루는 데이터 타입

## 1) DataFrame: 2차원의 표 형식 데이터 => key:[value1,value2]

## 2) Series: 1차원의 벡터 형식 데이터 => list, tuple, ndarray

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    {'이름':['홍길동', '장마철', '소나기', '더워요'],
     'Age': [23,55,24,16],
     '성별': ['male','female','female','male']    
    }
)

In [4]:
df

    이름  Age      성별
0  홍길동   23    male
1  장마철   55  female
2  소나기   24  female
3  더워요   16    male

In [8]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
type(df['이름'])

pandas.core.series.Series

In [12]:
type(df[['이름']])

pandas.core.frame.DataFrame

In [13]:
df['이름']

0    홍길동
1    장마철
2    소나기
3    더워요
Name: 이름, dtype: object

In [14]:
df[['이름']]

    이름
0  홍길동
1  장마철
2  소나기
3  더워요

In [15]:
df['이름'].ndim

1

In [16]:
df[['이름']].ndim

2

## 시리즈 만들기 pd.Series([리스트자료], name='컬럼명')
* 이름을 가지고 있는 벡터

In [3]:
ages = pd.Series([22,35,58], name='Age')
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [4]:
ages[1:]

1    35
2    58
Name: Age, dtype: int64

In [8]:
ages.min()

np.int64(22)

In [9]:
ages.max()

np.int64(58)

In [11]:
ages.describe()

count     3.000000
mean     38.333333
std      18.230012
min      22.000000
25%      28.500000
50%      35.000000
75%      46.500000
max      58.000000
Name: Age, dtype: float64

In [12]:
ages.mean()

np.float64(38.333333333333336)

# 판다스에서 자료 불러오기, 저장하기
* csv, tsv, excel, json, html
* pd.read_확장자

In [14]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   ---- ----------------------------------- 30.7/250.9 kB 1.4 MB/s eta 0:00:01
   ---------------------------------------- 250.9/250.9 kB 3.9 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.5

In [15]:
df1 = pd.read_excel("./data/Online Retail.xlsx")
df1

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [18]:
df2 = pd.read_excel("./data/아파트(매매)_실거래가_20240806113828.xlsx", header=12, index_col='NO')
df2.head(13)

C:\Users\5-11\miniforge3\envs\fintech\lib\site-packages\openpyxl\styles\stylesheet.py:237: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

,시군구,번지,본번,부번,단지명,전용면적(㎡),계약년월,계약일,거래금액(만원),동,층,매수자,매도자,건축년도,도로명,해제사유발생일,거래유형,중개사소재지,등기일자,주택유형
NO,,,,,,,,,,,,,,,,,,,,
1,서울특별시 영등포구 당산동5가,42,42,0,당산삼성래미안4차,115.7800,202407,31,"139,000",-,4,개인,개인,2003,당산로 214,-,직거래,-,-,아파트
2,강원특별자치도 원주시 지정면 가곡리,1512,1512,0,원주롯데캐슬골드파크1차(5단지),84.9644,202407,31,"38,900",-,10,개인,개인,2019,신지정로 250,20240802,중개거래,강원 원주시,-,아파트
3,대구광역시 달성군 화원읍 구라리,1650,1650,0,대곡역래미안,84.5958,202407,31,"29,500",-,11,개인,개인,2007,비슬로539길 35,-,중개거래,대구 달성군,-,아파트
4,광주광역시 남구 진월동,312-7,312,7,광명,70.6250,202407,31,"16,900",-,1,개인,개인,1998,광복마을길 63,-,중개거래,광주 남구,-,아파트
5,광주광역시 남구 진월동,331-93,331,93,중흥,84.8400,202407,31,"17,500",102,13,개인,개인,1992,서문대로749번마길 30,-,직거래,-,24.07.31,아파트
6,경기도 양평군 양평읍 양근리,140-5,140,5,양평현대,59.7000,202407,31,"22,500",-,14,개인,개인,1996,관문길 60,-,중개거래,경기 양평군,-,아파트
7,서울특별시 동대문구 장안동,587,587,0,동대문더퍼스트데시앙,59.8074,202407,31,"80,500",-,10,개인,개인,2019,장한로27가길 37,-,중개거래,서울 동대문구,-,아파트
8,대구광역시 달성군 화원읍 천내리,690-1,690,1,화원파크뷰우방아이유쉘,69.6413,202407,31,"38,000",-,17,개인,개인,2022,명천로21길 55,-,중개거래,대구 달서구,-,아파트
9,충청남도 천안시서북구 성거읍 신월리,2-26,2,26,천안삼환나우빌,84.9132,202407,31,"22,800",-,7,개인,개인,2005,봉주로 120,-,중개거래,충남 천안시서북구,-,아파트
10,경기도 양평군 양평읍 창대리,844,844,0,한화포레나양평,59.8551,202407,31,"31,500",-,19,개인,개인,2023,남북로 53,-,중개거래,경기 양평군,-,아파트
11,서울특별시 동대문구 용두동,39-446,39,446,용두아파트,47.5000,202407,31,"40,000",-,1,개인,개인,1974,고산자로32길 44,-,중개거래,서울 동대문구,-,아파트
12,서울특별시 서대문구 대현동,144,144,0,신촌럭키,83.3800,202407,31,"98,000",-,11,개인,개인,1999,이화여대길 50-12,-,중개거래,서울 서대문구,-,아파트
13,서울특별시 중랑구 면목동,193-1,193,1,면목한신,58.4600,202407,31,"54,500",-,7,개인,개인,1988,중랑천로 20,-,중개거래,서울 중랑구,-,아파트

## csv 파일 읽기
* pd.read_csv(파일명, 옵션들)

In [22]:
df3=pd.read_csv("./data/06고객이탈예측.csv", encoding='cp949')
df3

,회원ID,성별,고연령,배우자,피부양자,가입기간,전화서비스,2회선이상,인터넷서비스,온라인보안,...,기기보호서비스,기술지원,스트리밍TV,스트리밍Movies,약정옵션,온라인고지서,지불수단,월요금,합산요금,이탈여부
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,6840-RESVB,Male,0,Yes,Yes,24,Yes,Yes,DSL,Yes,...,Yes,Yes,Yes,Yes,One year,Yes,Mailed check,84.80,1990.5,No
7039,2234-XADUH,Female,0,Yes,Yes,72,Yes,Yes,Fiber optic,No,...,Yes,No,Yes,Yes,One year,Yes,Credit card (automatic),103.20,7362.9,No
7040,4801-JZAZL,Female,0,Yes,Yes,11,No,No phone service,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.60,346.45,No
7041,8361-LTMKD,Male,1,Yes,No,4,Yes,Yes,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Mailed check,74.40,306.6,Yes
7042,3186-AJIEK,Male,0,No,No,66,Yes,No,Fiber optic,Yes,...,Yes,Yes,Yes,Yes,Two year,Yes,Bank transfer (automatic),105.65,6844.5,No

## json 파일 읽기
* pd.read_json

-----------------------------------------------------------------------------------------------------------------------

In [27]:
import os
from sqlalchemy import create_engine
import pymysql
from dotenv import load_dotenv
pymysql.install_as_MySQLdb()
load_dotenv(dotenv_path="../05data_scraping/.env_db")

True

In [30]:

engine = create_engine(f'{os.getenv("db")}+{os.getenv("dbtype")}://{os.getenv("id")}:{os.getenv("pw")}@{os.getenv("host")}/{os.getenv("database")}')
conn = engine.connect()
data_07 = pd.read_sql('2024_07_29_stock_company_info',con=conn)
data_08 = pd.read_sql('2024_08_05_stock_company_info',con=conn)
conn.close()

In [31]:
data_07

,증권종류,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
0,유가증권,산일전기,062040,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","유입, 몰드, 주상, 건식 변압기 등",2024-07-29,12월,박동석,http://www.sanil.co.kr,경기도
1,유가증권,에이치에스효성,487570,기타 금융업,지주사업,2024-07-29,12월,조현상..,http://www.hshyosung.com,서울특별시
2,"코스닥, 투자주의종목",엔에이치스팩31호,481890,금융 지원 서비스업,금융지원서비스업,2024-07-26,12월,이시형,,서울특별시
3,코스닥,SK증권제13호스팩,473950,금융 지원 서비스업,기업인수목적 주식회사,2024-07-25,12월,임율표,,서울특별시
4,코스닥,엑셀세라퓨틱스,373110,기초 의약물질 제조업,CellCor SFD/CD(세포배양배지),2024-07-15,12월,이의일,,서울특별시
...,...,...,...,...,...,...,...,...,...,...
415,코스닥,에이치브이엠,295310,1차 비철금속 제조업,"Ni계 합금, Fe계 합금, 스퍼터링타겟, Cu계 합금 등",2024-06-28,12월,문승호,http://hvm.co.kr/,경기도
416,코넥스,팡스카이,266350,소프트웨어 개발 및 공급업,게임 개발 및 리퍼블리싱,2024-06-28,12월,조호현..,http://www.panggame.com/,서울특별시
417,코스닥,하이젠알앤엠,160190,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","전동기 및 발전기 (범용모터, 서보모터)",2024-06-27,12월,김재학,http://higenrnm.com,경상남도
418,코스닥,한국제15호스팩,479880,금융 지원 서비스업,기업인수합병,2024-06-26,12월,유한,,서울특별시
419,코스닥,에스오에스랩,464080,"측정, 시험, 항해, 제어 및 기타 정밀기기 제조업; 광학기기 제외",산업용 및 차량용 라이다(LiDAR),2024-06-25,12월,정지성,http://soslab.co,광주광역시

In [32]:
data_08

,증권종류,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
0,코스닥,피앤에스미캐닉스,460940,의료용 기기 제조업,보행재활로봇 시스템,2024-07-31,12월,박광훈,http://walkbot.co.kr,서울특별시
1,유가증권,산일전기,062040,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","유입, 몰드, 주상, 건식 변압기 등",2024-07-29,12월,박동석,http://www.sanil.co.kr,경기도
2,"유가증권, KRX300",에이치에스효성,487570,기타 금융업,지주사업,2024-07-29,12월,조현상..,http://www.hshyosung.com,서울특별시
3,코스닥,엔에이치스팩31호,481890,금융 지원 서비스업,금융지원서비스업,2024-07-26,12월,이시형,,서울특별시
4,코스닥,SK증권제13호스팩,473950,금융 지원 서비스업,기업인수목적 주식회사,2024-07-25,12월,임율표,,서울특별시
...,...,...,...,...,...,...,...,...,...,...
2701,"유가증권, KTOP30, KOSPI200, KRX300",유한양행,000100,의약품 제조업,"의약품(삐콤씨, 안티푸라민, 렉라자, 로수바미브, 코푸시럽 등), 생활용품(유한락스...",1962-11-01,12월,대표이..,http://www.yuhan.co.kr,서울특별시
2702,"유가증권, KOSPI200, KRX300",CJ대한통운,000120,도로 화물 운송업,"Contract Logistics, 포워딩, 항만하역, 해운, 택배국제특송, SCM...",1956-07-02,12월,신영수..,http://www.cjlogistics.com,서울특별시
2703,유가증권,경방,000050,종합 소매업,"섬유류(면사,면혼방사,면직물,면혼방직물,화섬사,화섬직물) 제조,도매,수출입",1956-03-03,12월,"김준,..",http://www.kyungbang.co.kr,서울특별시
2704,유가증권,유수홀딩스,000700,회사 본부 및 경영 컨설팅 서비스업,지주사업,1956-03-03,12월,송영규,http://www.eusu-holdings.com,서울특별시
2705,유가증권,한진중공업홀딩스,003480,연료용 가스 제조 및 배관공급업,지주회사,1956-03-03,12월,조남호..,http://www.hhic-holdings.com,경기도

In [33]:
df5=pd.read_json("./data/서울특별시_관광지입장정보_2011_2016.json")
df5

    ForNum  NatNum  addrCd gungu      resNm  rnum   sido  yyyymm
0    44722   75991    1111   종로구        창덕궁     1  서울특별시  201112
1        0   11017    1111   종로구        운현궁     2  서울특별시  201112
2   132399  237330    1111   종로구        경복궁     3  서울특별시  201112
3     3133   21267    1111   종로구        창경궁     4  서울특별시  201112
4    18226   24223    1111   종로구         종묘     5  서울특별시  201112
..     ...     ...     ...   ...        ...   ...    ...     ...
62    5588   44232    1141  서대문구  서대문형무소역사관     8  서울특별시  201512
63       0   22587    1141  서대문구  서대문자연사박물관     9  서울특별시  201512
64   29520    8822    1144   마포구    트릭아이미술관    10  서울특별시  201512
65       3    1647    1165   서초구      헌릉ㆍ인릉    11  서울특별시  201512
66     492   14454    1168   강남구      선릉·정릉    12  서울특별시  201512

[67 rows x 8 columns]

## mysql titanic DB에서 데이터 가져오기

In [2]:
import os
from sqlalchemy import create_engine
import pymysql
from dotenv import load_dotenv
pymysql.install_as_MySQLdb()
load_dotenv(dotenv_path="../05data_scraping/.env_db3")

True

In [3]:

engine = create_engine(f'{os.getenv("db")}+{os.getenv("dbtype")}://{os.getenv("id")}:{os.getenv("pw")}@{os.getenv("host")}/{os.getenv("database")}')
conn = engine.connect()
passenger = pd.read_sql('passenger',con=conn)
surv = pd.read_sql('surv',con=conn)
ticket = pd.read_sql('ticket',con=conn)

conn.close()

In [4]:
passenger

,PassengerId,Name,Sex,Age,SibSp,Parch
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
1,192,"Carbines, Mr. William",male,19.0,0,0
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0
621,197,"Mernagh, Mr. Robert",male,NaN,0,0
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [5]:
surv

     PassengerId  Survived
0            762         0
1            665         1
2            809         0
3            332         0
4             21         0
..           ...       ...
441          698         1
442          778         1
443          157         1
444          350         0
445          881         1

[446 rows x 2 columns]

In [6]:
ticket

     PassengerId         Ticket  Pclass      Fare    Cabin Embarked
0            486           4133       3   25.4667     None        S
1            119       PC 17558       1  247.5208  B58 B60        C
2            836       PC 17756       1   83.1583      E49        C
3            528       PC 17483       1  221.7792      C95        S
4            396         350052       3    7.7958     None        S
..           ...            ...     ...       ...      ...      ...
440          692         349256       3   13.4167     None        C
441          585           3411       3    8.7125     None        C
442          265         382649       3    7.7500     None        Q
443          328          28551       2   13.0000        D        S
444          136  SC/PARIS 2133       2   15.0458     None        C

[445 rows x 6 columns]

## 3개의 데이터프레임을 1개로 합치기 
* join()
* merge()
* concat()

In [11]:
pd.concat([passenger, ticket, surv], keys='PassengerId')

C:\Users\5-11\AppData\Local\Temp\ipykernel_10232\787332130.py:1: FutureWarning: The behavior of pd.concat with len(keys) != len(objs) is deprecated. In a future version this will raise instead of truncating to the smaller of the two sequences
  pd.concat([passenger, ticket, surv], keys='PassengerId')

       PassengerId                                             Name     Sex  \
P 0            193  Andersen-Jensen, Miss. Carla Christine Nielsine  female
  1            192                            Carbines, Mr. William    male
  2            715                            Greenberg, Mr. Samuel    male
  3            533                             Elias, Mr. Joseph Jr    male
  4            133   Robins, Mrs. Alexander A (Grace Charity Laury)  female
...            ...                                              ...     ...
s 441          698                                              NaN     NaN
  442          778                                              NaN     NaN
  443          157                                              NaN     NaN
  444          350                                              NaN     NaN
  445          881                                              NaN     NaN

        Age  SibSp  Parch Ticket  Pclass  Fare Cabin Embarked  Survived
P 0    19.0    1.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN
  1    19.0    0.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN
  2    52.0    0.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN
  3    17.0    1.0    1.0    NaN     NaN   NaN   NaN      NaN       NaN
  4    47.0    1.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN
...     ...    ...    ...    ...     ...   ...   ...      ...       ...
s 441   NaN    NaN    NaN    NaN     NaN   NaN   NaN      NaN       1.0
  442   NaN    NaN    NaN    NaN     NaN   NaN   NaN      NaN       1.0
  443   NaN    NaN    NaN    NaN     NaN   NaN   NaN      NaN       1.0
  444   NaN    NaN    NaN    NaN     NaN   NaN   NaN      NaN       0.0
  445   NaN    NaN    NaN    NaN     NaN   NaN   NaN      NaN       1.0

[1514 rows x 12 columns]

In [13]:
test2=pd.merge(passenger,ticket, how='inner', on='PassengerId')
test2.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,192,"Carbines, Mr. William",male,19.0,0,0,28424,2,13.0000,None,S
1,715,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,2,13.0000,None,S
2,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,2690,3,7.2292,None,C
3,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,A/5. 3337,3,14.5000,None,S
4,597,"Leitch, Miss. Jessie Wills",female,NaN,0,0,248727,2,33.0000,None,S

In [16]:
test3=pd.merge(test2,surv, how='inner', on='PassengerId')
test3

Empty DataFrame
Columns: [PassengerId, Name, Sex, Age, SibSp, Parch, Ticket, Pclass, Fare, Cabin, Embarked, Survived]
Index: []

In [22]:
ticket=ticket.set_index('PassengerId')
ticket

                    Ticket  Pclass      Fare    Cabin Embarked
PassengerId
486                   4133       3   25.4667     None        S
119               PC 17558       1  247.5208  B58 B60        C
836               PC 17756       1   83.1583      E49        C
528               PC 17483       1  221.7792      C95        S
396                 350052       3    7.7958     None        S
...                    ...     ...       ...      ...      ...
692                 349256       3   13.4167     None        C
585                   3411       3    8.7125     None        C
265                 382649       3    7.7500     None        Q
328                  28551       2   13.0000        D        S
136          SC/PARIS 2133       2   15.0458     None        C

[445 rows x 5 columns]

In [23]:
passenger.join(ticket)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,NaN,NaN,NaN,NaN,NaN
1,192,"Carbines, Mr. William",male,19.0,0,0,A/5 21171,3.0,7.250,None,S
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0,NaN,NaN,NaN,NaN,NaN
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,STON/O2. 3101282,3.0,7.925,None,S
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,113803,1.0,53.100,C123,S
...,...,...,...,...,...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0,A/5. 3336,3.0,16.100,None,S
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,230136,2.0,39.000,F4,S
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0,31028,2.0,10.500,None,S
621,197,"Mernagh, Mr. Robert",male,NaN,0,0,NaN,NaN,NaN,NaN,NaN
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1,NaN,NaN,NaN,NaN,NaN

In [24]:
data=pd.read_csv("https://raw.githubusercontent.com/haram4th/ablearn/main/Taitanic_train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 데이터프레임을 조회
* 앞쪽 5개 행을 읽는 head()
* 뒤쪽 5개 행을 읽는 tail()

In [25]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
# head는 60을 넘어가면 자동축약

## 데이터의 타입(자료형)을 보고 싶을 때 .dtypes

In [28]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# 데이터프레임의 컬럼명, 결측치, 데이터타입을 같이 표시 .info()

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 데이터프레임에서 숫자 데이터의 기초통계를 보는 함수.describe()

In [32]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# 판다스에서 일부 자료만 추출하기

# 1)데이터프레임에서 1개 컬럼만 가져오기

In [34]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [38]:
display(data['Name'])
print(type(data['Name']))

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

<class 'pandas.core.series.Series'>

## 2) 2개 이상의 컬럼 가져오기

In [44]:
data[['Name','Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [45]:
data[['Name','Sex','Pclass']]

                                                  Name     Sex  Pclass
0                              Braund, Mr. Owen Harris    male       3
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female       1
2                               Heikkinen, Miss. Laina  female       3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female       1
4                             Allen, Mr. William Henry    male       3
..                                                 ...     ...     ...
886                              Montvila, Rev. Juozas    male       2
887                       Graham, Miss. Margaret Edith  female       1
888           Johnston, Miss. Catherine Helen "Carrie"  female       3
889                              Behr, Mr. Karl Howell    male       1
890                                Dooley, Mr. Patrick    male       3

[891 rows x 3 columns]

# 데이터프레임 컬럼 순서바꾸기

In [46]:
data=data[['PassengerId','Survived','Name','Age','Pclass','Sex','SibSp','Parch','Ticket','Fare','Cabin','Embarked']]
data

,PassengerId,Survived,Name,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,"Braund, Mr. Owen Harris",22.0,3,male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,female,1,0,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",26.0,3,female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,female,1,0,113803,53.1000,C123,S
4,5,0,"Allen, Mr. William Henry",35.0,3,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",27.0,2,male,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",19.0,1,female,0,0,112053,30.0000,B42,S
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,3,female,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",26.0,1,male,0,0,111369,30.0000,C148,C
890,891,0,"Dooley, Mr. Patrick",32.0,3,male,0,0,370376,7.7500,NaN,Q

## 데이터프레임에서 일부 컬럼만 가져오기2
* loc: 인덱스이름과 컬럼명으로 일부를 추출해서 가져옴
* iloc: 슬라이싱을 이용해서 가져옴

In [49]:
data.loc[100:130,['Ticket','Name']]

                Ticket                               Name
100             349245            Petranec, Miss. Matilda
101             349215   Petroff, Mr. Pastcho ("Pentcho")
102              35281          White, Mr. Richard Frasar
103               7540         Johansson, Mr. Gustaf Joel
104            3101276     Gustafsson, Mr. Anders Vilhelm
105             349207              Mionoff, Mr. Stoytcho
106             343120   Salkjelsvik, Miss. Anna Kristine
107             312991             Moss, Mr. Albert Johan
108             349249                    Rekic, Mr. Tido
109             371110                Moran, Miss. Bertha
110             110465     Porter, Mr. Walter Chamberlain
111               2665               Zabour, Miss. Hileni
112             324669             Barton, Mr. David John
113               4136            Jussila, Miss. Katriina
114               2627              Attalah, Miss. Malake
115  STON/O 2. 3101294              Pekoniemi, Mr. Edvard
116             370369               Connors, Mr. Patrick
117              11668    Turpin, Mr. William John Robert
118           PC 17558           Baxter, Mr. Quigg Edmond
119             347082  Andersson, Miss. Ellis Anna Maria
120       S.O.C. 14879        Hickman, Mr. Stanley George
121          A4. 54510         Moore, Mr. Leonard Charles
122             237736               Nasser, Mr. Nicholas
123              27267                Webber, Miss. Susan
124              35281        White, Mr. Percival Wayland
125               2651       Nicola-Yarred, Master. Elias
126             370372                McMahon, Mr. Martin
127            C 17369          Madsen, Mr. Fridtjof Arne
128               2668                  Peter, Miss. Anna
129             347061                 Ekstrom, Mr. Johan
130             349241               Drazenoic, Mr. Jozef

In [50]:
data.iloc[10:20,4:8]

    Pclass     Sex  SibSp  Parch
10       3  female      1      1
11       1  female      0      0
12       3    male      0      0
13       3    male      1      5
14       3  female      0      0
15       2  female      0      0
16       3    male      4      1
17       2    male      0      0
18       3  female      1      0
19       3  female      0      0

In [51]:
data.iloc[:20:2,::-1]

,Embarked,Cabin,Fare,Ticket,Parch,SibSp,Sex,Pclass,Age,Name,Survived,PassengerId
0,S,NaN,7.2500,A/5 21171,0,1,male,3,22.0,"Braund, Mr. Owen Harris",0,1
2,S,NaN,7.9250,STON/O2. 3101282,0,0,female,3,26.0,"Heikkinen, Miss. Laina",1,3
4,S,NaN,8.0500,373450,0,0,male,3,35.0,"Allen, Mr. William Henry",0,5
6,S,E46,51.8625,17463,0,0,male,1,54.0,"McCarthy, Mr. Timothy J",0,7
8,S,NaN,11.1333,347742,2,0,female,3,27.0,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,9
10,S,G6,16.7000,PP 9549,1,1,female,3,4.0,"Sandstrom, Miss. Marguerite Rut",1,11
12,S,NaN,8.0500,A/5. 2151,0,0,male,3,20.0,"Saundercock, Mr. William Henry",0,13
14,S,NaN,7.8542,350406,0,0,female,3,14.0,"Vestrom, Miss. Hulda Amanda Adolfina",0,15
16,Q,NaN,29.1250,382652,1,4,male,3,2.0,"Rice, Master. Eugene",0,17
18,S,NaN,18.0000,345763,0,1,female,3,31.0,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",0,19

# 특정 컬럼에서 유일값 요소 출력하기 .unique()

In [52]:
data['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

# 특정 컬럼에서 유일값 개수 출력하기 .nunique()

In [53]:
data['Embarked'].nunique()

3

# 카테고리 컬럼에서 유일값 별 개수를 세는 함수 value_counts()

In [54]:
data['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [55]:
data['Age'].value_counts()

Age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

# 데이터를 정렬하는 함수 sort_values(by='컬럼명')

In [56]:
data.sort_values(by="Name")

,PassengerId,Survived,Name,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,"Abbing, Mr. Anthony",42.0,3,male,0,0,C.A. 5547,7.5500,NaN,S
746,747,0,"Abbott, Mr. Rossmore Edward",16.0,3,male,1,1,C.A. 2673,20.2500,NaN,S
279,280,1,"Abbott, Mrs. Stanton (Rosa Hunt)",35.0,3,female,1,1,C.A. 2673,20.2500,NaN,S
308,309,0,"Abelson, Mr. Samuel",30.0,2,male,1,0,P/PP 3381,24.0000,NaN,C
874,875,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",28.0,2,female,1,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
286,287,1,"de Mulder, Mr. Theodore",30.0,3,male,0,0,345774,9.5000,NaN,S
282,283,0,"de Pelsmaeker, Mr. Alfons",16.0,3,male,0,0,345778,9.5000,NaN,S
361,362,0,"del Carlo, Mr. Sebastiano",29.0,2,male,1,0,SC/PARIS 2167,27.7208,NaN,C
153,154,0,"van Billiard, Mr. Austin Blyler",40.5,3,male,0,2,A/5. 851,14.5000,NaN,S
868,869,0,"van Melkebeke, Mr. Philemon",NaN,3,male,0,0,345777,9.5000,NaN,S

In [57]:
data.sort_values(by=['Age','Name'],ascending=[False,True])

,PassengerId,Survived,Name,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,"Barkworth, Mr. Algernon Henry Wilson",80.0,1,male,0,0,27042,30.0000,A23,S
851,852,0,"Svensson, Mr. Johan",74.0,3,male,0,0,347060,7.7750,NaN,S
493,494,0,"Artagaveytia, Mr. Ramon",71.0,1,male,0,0,PC 17609,49.5042,NaN,C
96,97,0,"Goldschmidt, Mr. George B",71.0,1,male,0,0,PC 17754,34.6542,A5,C
116,117,0,"Connors, Mr. Patrick",70.5,3,male,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
55,56,1,"Woolner, Mr. Hugh",NaN,1,male,0,0,19947,35.5000,C52,S
354,355,0,"Yousif, Mr. Wazli",NaN,3,male,0,0,2647,7.2250,NaN,C
495,496,0,"Yousseff, Mr. Gerious",NaN,3,male,0,0,2627,14.4583,NaN,C
240,241,0,"Zabour, Miss. Thamine",NaN,3,female,1,0,2665,14.4542,NaN,C
868,869,0,"van Melkebeke, Mr. Philemon",NaN,3,male,0,0,345777,9.5000,NaN,S

# 컬럼을 인덱스로 지정하기 set_index("컬럼명")

In [63]:
data=data.set_index(["PassengerId","Name"])

KeyError: "None of ['PassengerId', 'Name'] are in the columns"

In [64]:
data

,,Survived,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Name,,,,,,,,,,
1,"Braund, Mr. Owen Harris",0,22.0,3,male,1,0,A/5 21171,7.2500,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,38.0,1,female,1,0,PC 17599,71.2833,C85,C
3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,0,STON/O2. 3101282,7.9250,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,1,0,113803,53.1000,C123,S
5,"Allen, Mr. William Henry",0,35.0,3,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",0,27.0,2,male,0,0,211536,13.0000,NaN,S
888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,0,112053,30.0000,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,1,2,W./C. 6607,23.4500,NaN,S
890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,0,111369,30.0000,C148,C
891,"Dooley, Mr. Patrick",0,32.0,3,male,0,0,370376,7.7500,NaN,Q

# 인덱스를 숫자로 초기화

In [66]:
data=data.reset_index()
data

,PassengerId,Name,Survived,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",0,22.0,3,male,1,0,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,female,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,1,0,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",0,35.0,3,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",0,27.0,2,male,0,0,211536,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,0,112053,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,1,2,W./C. 6607,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,0,111369,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",0,32.0,3,male,0,0,370376,7.7500,NaN,Q

# 컬럼 이름 출력 .columns

In [68]:
data.columns[0:]

Index(['PassengerId', 'Name', 'Survived', 'Age', 'Pclass', 'Sex', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# 컬럼 이름 변경하기
* rename({이름1 : 변경할 이름1})
* columns=[컬럼이름]

In [69]:
data.rename(columns={'PassengerId':'승객번호'})

,승객번호,Name,Survived,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",0,22.0,3,male,1,0,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,female,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,1,0,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",0,35.0,3,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",0,27.0,2,male,0,0,211536,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,0,112053,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,1,2,W./C. 6607,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,0,111369,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",0,32.0,3,male,0,0,370376,7.7500,NaN,Q

In [71]:
data.columns

Index(['PassengerId', 'Name', 'Survived', 'Age', 'Pclass', 'Sex', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [72]:
data.columns=['승객번호', '승객이름', '생존여부', '나이', '선실등급', '성별', '형제자매수',
       '부모자식수', '승차권금액', '요금', '좌석번호', '정박지']

In [73]:
data

,승객번호,승객이름,생존여부,나이,선실등급,성별,형제자매수,부모자식수,승차권금액,요금,좌석번호,정박지
0,1,"Braund, Mr. Owen Harris",0,22.0,3,male,1,0,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,female,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,1,0,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",0,35.0,3,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",0,27.0,2,male,0,0,211536,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,0,112053,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,1,2,W./C. 6607,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,0,111369,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",0,32.0,3,male,0,0,370376,7.7500,NaN,Q

# 컬럼 삭제하기
* del 변수명['컬럼명]
* 변수명.drop('컬럼명', axis=1)
* 변수명.drop(['컬럼명1','컬럼명2'] axis=1)

In [75]:
data.drop('형제자매수',axis=1)

,승객번호,승객이름,생존여부,나이,선실등급,성별,부모자식수,승차권금액,요금,좌석번호,정박지
0,1,"Braund, Mr. Owen Harris",0,22.0,3,male,0,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,female,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,0,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",0,35.0,3,male,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",0,27.0,2,male,0,211536,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,112053,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,2,W./C. 6607,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,111369,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",0,32.0,3,male,0,370376,7.7500,NaN,Q

# 데이터프레임의 컬럼과 컬럼을 연산해서 새로운 컬럼만들기

# 데이터 타입 바꾸기 .astype() or .apply()
* data['승객번호'].astype('str')
* data['승객번호'].apply(lambda x: str(x))